[{"time":"8:00","break":true,"data":"Registration"},{"time":"8:50","break":true,"data":"Welcome"},{"time":"9:00","break":false,"data":{"speaker":"Pawel Szulc","speaker_twitter":"rabbitonweb","speaker_github":"","speaker_website":"www.rabbitonweb.com","speaker_bio":"Pawel Szulc is primarily a programmer. Always was and always will be. Experienced professionally in JVM ecosystem, currently having tons of fun with Scala, Erlang, Clojure and Haskell. By day working on (not that) BigData problems with Akka Stream ∓ Apache Spark, by night hacking whatever he finds interesting at that given moment. Humble apprentice of Functional Programming.","speaker_photo":"images/speakers/szulc.png","talk_title":"Having a cake and eating it too. Introduction to Typeclasses","talk_description":"<p>Being in a Scala community, you&#39;ve probably heard about type classes. Very basic concept that both commonly used among many Scala libraries and at the same time very fundamental to understand any theoretical concepts behind Functional Programming. This short talk is all about explaining what Type classes are, how to use them and how to create them, with strong emphasis on answering the question &quot;why should I even care?&quot;. We will focus on both on prons and cons, however speaker will probably be a bit biased towards the former.</p><p>We will follow story of couple of developers, struggling with conceptual design problem. As many before them, they will eventually reinvent the wheel. The solution they will end up with, is what we call a Type class.</p><p>This is a &quot;from zero to hero&quot; talk. Preferable audience are people who want to:</p><ol><li>understand any shapeless/scalaz/cats presentation out there (this presentation will give you ability to survive first 10 minutes of mentioned talks)</li><li>be enlightened that &quot;monads are just type classes with some laws&quot; (this is not a monad tutorial though)</li><li>get the &quot;aha!&quot; moment, realising that they&#39;ve been using Type classes from time to time, without knowing it.</li></ol>"}},{"time":"9:30","break":false,"data":{"speaker":"Mathias Doenitz","speaker_twitter":"sirthias","speaker_github":"","speaker_website":"","speaker_bio":"Among many other things Mathias is the original author of spray.io, which was acquired by Typesafe in 2013. As a long-time and active member of the Java and Scala open-source communities he is especially excited about everything performance-, scalability- and web-related.","speaker_photo":"images/speakers/doenitz.jpg","talk_title":"Swave - a fresh Reactive Streams Implementation","talk_description":"<p>One of the most exciting developments of the last two years has been the advent of &quot;Reactive Streams&quot;, a powerful new abstraction for defining and scaling pipelined processing logic in a fully asynchronous, non-blocking and generally <em>reactive</em> fashion.</p><p>In this talk I&#39;ll introduce you to a new, fully-featured Reactive Streams infrastructure toolkit for Scala, called &quot;Swave&quot;, which has been built from scratch with a special focus on maximum performance, a simple and powerful API as well as minimal dependencies.</p><p>We&#39;ll look into the general design approach, feature set and core implementation choices as well as basic benchmark and performance figures.</p><p>We&#39;ll also contrast with other Reactive Streams implementations and highlight pros and cons from a user&#39;s perspective.</p><p>So the next time you are reaching for a Reactive Streams toolkit you&#39;ll have one more choice to pick from.</p>"}},{"time":"10:00","break":true,"data":"Coffee Break"},{"time":"10:30","break":false,"data":{"speaker":"Eric Torreborre","speaker_twitter":"etorreborre","speaker_github":"","speaker_website":"","speaker_bio":"I am a software developer living in Berlin, working for Zalando. I am the creator of the specs2 library for software specifications in Scala.","speaker_photo":"images/speakers/torreborre.jpg","talk_title":"The Eff monad, one monad to rule them all","talk_description":"<p>Scala has has been my gateway drug to functional programming and to many &quot;unknown unknowns&quot;. When I manage to go from &quot;unknown unknowns&quot; to &quot;known knowns&quot; I try to spread the word.</p><p>Monad transformers are a neat way to compose effectul computations: pass some configuration, read/write from disk, track errors...</p><p>However they can be a bit cumbersome to deal with, especially if you want to use different stacks sharing some common effects: for example a stack to interact with AWS and another one for Hadoop computations.</p><p>This talk will shortly introduce monad transformers in Scala and their drawbacks then present the Eff monad.</p><p>The Eff monad has some really interesting properties:</p><ul><li>effects can be developed completely independently from each other</li><li>effects can be interpreted in different ways and the interpreters can be composed together</li><li>it is based on an efficient &quot;Free monad&quot; (avoiding the issue of quadratic flatMaps)</li><li>with the Eff monad you will never have to re-implement the Monad operations (point / flatMap) again!</li></ul>"}},{"time":"11:00","break":false,"data":{"speaker":"Krzysztof Romanowski","speaker_twitter":"RomanowskiKr","speaker_github":"romanowski","speaker_website":"typosafe.pl","speaker_bio":"Krzysztof is Scala specialist @ Virtuslab where he has spent endless hours debugging Scala IDE, SBT, IntelliJ or even Scala compiler itself. Author of expression evaluator engine for Scala IDE.","speaker_photo":"images/speakers/romanowski.png","talk_title":"Incremental compiler: taming scalac","talk_description":"<p>In the wild, Scalac is an enormous beast. When run freely compilation takes ages even for simple changes in your project. Luckily, in the end of stone age of scala tooling first incremental compilers emerged and time spent on scala compilation’s become less and less noticeable...</p><p>In this talk I want to explain what incremental compiler is and how it works in sbt world. Further down the road I will show how name hashing reduces amount of compiled files. In the end we will ask ourselves if we can do any better (and by what cost).</p>"}},{"time":"11:30","break":false,"data":{"speaker":"Maciej Biłas","speaker_twitter":"maciejb","speaker_github":"","speaker_website":"","speaker_bio":"Maciej Biłas is a software engineer at Adform Research. He spent over 3 years developing production Scala code and many more in the JVM ecosystem. Makes data run in the pipes during the day.","speaker_photo":"images/speakers/bilas.png","talk_title":"akka-cluster-etcd","talk_description":"<p>Modern container-based cluster computing frameworks like Mesos, Kubernetes, or EC2 Container Service usually execute services on nodes not known beforehand. This creates a problem for Akka Cluster deployments, where seed nodes need to be established.</p><p>In this talk we present a zero-configuration deployment scenario for Akka Cluster using etc.d as a distributed configuration store.</p>"}},{"time":"12:00","break":true,"data":"Lunch"},{"time":"13:30","break":false,"data":{"speaker":"Lukasz Lenart","speaker_twitter":"lukaszlenart","speaker_github":"","speaker_website":"","speaker_bio":"Life hacker with positive attitude but sometimes he's losing his faith in humanity. Still believes in good (people). Java coder coding in Scala on daily basis but without conviction. Fell in love with CSS and Javascript, especially in CoffeeScript. Apache Struts lead developer but no one knows why. Believing that all code you wrote is already @depreacted!","speaker_photo":"images/speakers/lenart.png","talk_title":"Lift framework in 30 minutes","talk_description":"<p>In 30 minutes I want to build a full blown web app based on Lift framework.</p>"}},{"time":"14:00","break":false,"data":{"speaker":"Valentin Kasas","speaker_twitter":"ValentinKasas","speaker_github":"","speaker_website":"kanaka.io/blog","speaker_bio":"After having spent half a dozen years writing boilerplatey C++ and Java code, discovering Scala was a bliss. Ever since, I look for every occasion to train my FP muscles, and to share my sheer enthusiasm about Scala.","speaker_photo":"images/speakers/kasas.png","talk_title":"Shapeless ? Easy !","talk_description":"<p>Shapeless is known for being difficult to grasp, even for experienced Scala developers. In this talk, I will do my best to show you that this difficulty is somehow overrated.</p><p>Of course we&#39;ll only scratch the surface there. But hopefully, you&#39;ll take home enough hints to begin your own exploration of what this powerful tool enables.</p>"}},{"time":"14:30","break":false,"data":{"speaker":"Amira Lakhal","speaker_twitter":"MiraLak","speaker_github":"","speaker_website":"","speaker_bio":"Amira Lakhal is an Agile Java Scala developer at Valtech France. She is passionate about functional languages and Big Data. She is one of the Duchess France leaders where she helps women in IT to became role models.","speaker_photo":"images/speakers/lakhal.jpg","talk_title":"IOT, timeseries and prediction with Android, Cassandra and Spark","talk_description":"<p>IOT has a massive potential and its impact in our daily life is important. Here is an exemple of using a connected object and analysing its data: we&#39;ll see how to collect data using the accelerometer sensor of your smartphone. Then, we&#39;ll store it in Cassandra as a Timeseries model. Finally, we&#39;ll analyse those data and predict the activity with Spark. We will see a live demo on stage to show this solution working in realtime.</p>"}},{"time":"15:00","break":true,"data":"Break"},{"time":"15:30","break":false,"data":{"speaker":"Dmytro Petrashko","speaker_twitter":"darkdimius","speaker_github":"","speaker_website":"","speaker_bio":"Dmytro Petrashko is a programming languages and algorithms researcher and a doctoral assistant at EPFL. He is currently working on a doctorate as a research assistant in the School of Computer and Communication Sciences at the EPFL in Switzerland, on experimental Dotty compiler for Scala. Previously he was working on ScalaBlitz—macro generated collections for Scala.","speaker_photo":"images/speakers/petrashko.png","talk_title":"Making sense of initialization order in Scala","talk_description":"<p>In this talk we will discuss in detail the current object initialization order scheme in Scala.</p><p>Though a fundamental and seemingly basic feature, the order in which class fields are initialized is often a source of bugs and frustration for users. We will demonstrate how apparently-innocent changes can lead to surprising behavior at runtime.</p><p>Workarounds already exist in Scala—early initializers and lazy vals—and alternative compiler implementations could enhance the the safety guarantees provided at compile-time. We will look at some of these possibilities and will briefly discuss potential changes to initialization order in Dotty.</p>"}},{"time":"16:00","break":false,"data":{"speaker":"Jan Pustelnik","speaker_twitter":"gosubpl","speaker_github":"gosubpl","speaker_website":"","speaker_bio":"Jan is a Scala & Java developer at GFT Poland. He is very interested in how software works on low detail level and does not find big frameworks appealing. This is the main reason why he loves Scala, a very expressive language that allows one to build the right abstraction quickly without loosing the control on details.","speaker_photo":"images/speakers/pustelnik.png","talk_title":"Cool toolz in the Scalaz and Cats toolboxes","talk_description":"<p>In this talk we intend to show that the two libraries: Scalaz and Cats widely held to be cryptic, hermetic and full of scary Mooonads in reality contain lots of easy to use components ready to be embeded in your code to make it shorter, clearer and easier to maintain. We will look at certain constructs from pragmatic point of view as just &quot;Design Patterns&quot; that happen to match ideally functional programming style.</p>"}},{"time":"16:30","break":true,"data":"Break"},{"time":"17:00","break":false,"data":{"speaker":"Marco Borst, Slava Schmidt","speaker_twitter":"nmcborst","speaker_github":"","speaker_website":"","speaker_bio":"Marco Borst and Slava Schmidt are freelance Scala Developers. For Zalando SE they created Play-Swagger, an open source plugin that lets Play developers treat Swagger API specifications as the single source of thruth. This work did fuel their interest in protocol languages, the state of the art in API specifications and the safety that this specifications can provide in real world scenarios. They have experience presenting at multiple conferences and meetups from 2013 on, most notably the Java User Group Taiwan, Innovation Days, ScalaDay, QALab and JavaDay in the Ukraine, JavaDay in Belarus, the Scala User Group in Berlin and the Scala World Unconference in the UK.","speaker_photo":"images/speakers/borst.png, images/speakers/schmidt.png","talk_title":"Contract First, Session Types Later!","talk_description":"<p>This talk&#39;s about how actors should communicate with the outside world as expressed in Joe Armstrongs proposed Erlang implementation of &quot;UBF&quot;, the &quot;Universal Binary Format&quot; specification, a paper that let to the concept of Session Types. What are Session Types? What kind of a safety do they provide? We&#39;ll demo how &quot;Session Types&quot; can be unified with real world RESTFul applications, in an almost typesafe way.</p>"}},{"time":"17:30","break":false,"data":{"speaker":"Artur Bańkowski","speaker_twitter":"abankowski","speaker_github":"","speaker_website":"","speaker_bio":"Artur is a software architect mainly focused on backend of Web applications and APIs. He’s fascinated with Fast Data challenges and distributed architecture. His current weapon of choice is Scala though can write either JavaScript or PHP when in danger. Artur works in Evojam, softwarehouse committed to quality and scalability.","speaker_photo":"images/speakers/bankowski.png","talk_title":"Scala SWAT: Tackling 1 Billion Member Social Network","talk_description":"<p>Enabling blazing fast search on a 1 billion member social network demands special weapons and tactics. Let me take you on a journey around the edges of existing technologies. I&#39;ll tell you how we took advantage of the Scala ecosystem and modern tools to realize persistence and processing of such a data set.</p><p>About this conversation:</p><p>Case study focused on the client requirements and tools we have made use of to meet them. Thoughts, injuries and ideas about real life fast &amp; big data challenge brought to you directly from the trenches.</p>"}},{"time":"18:00","break":true,"data":"Ending"},{"time":"18:30","break":true,"data":"Party!"}]