[{"title":"Scalar 3!","permalink":"2017-03-12-scalar-3","date":"2017-03-12","dateFormated":"March 12, 2017","excerpt":"<p>They arrived in fifty mother ships, offering their friendship and advance technology to Earth. Skeptical of the visitors, Mike Donovan and Juliet Parrish infiltrated thei...</p>","body":"<p>They arrived in fifty mother ships, offering their friendship and advance technology to Earth. Skeptical of the visitors, Mike Donovan and Juliet Parrish infiltrated their ranks and soon discovered some startling secrets. The resistance is all that stands between us... and the visitors.</p><p>What walks down stairs, alone or in pairs, and makes a slinkity sound? A spring, a spring, a marvelous thing, everyone knows it&#39;s Slinky. It&#39;s Slinky, it&#39;s Slinky, for fun it&#39;s a wonderful toy. It&#39;s Slinky, it&#39;s Slinky, it&#39;s fun for a girl or a boy. It&#39;s fun for a girl or boy!</p><p>It seems today that all you see is violence in movies and sex on tv, but where are those good old-fashioned values on which we used to rely? Lucky there&#39;s a family guy, lucky there&#39;s a man who positively can do all the things that make us laugh and cry - he&#39;s our family guy!</p>"},{"title":"Scalar is starting in 3 days!","permalink":"2017-02-07-scalar-is-starting-in-3-days","date":"2017-02-07","dateFormated":"February 07, 2017","excerpt":"<p>1-2 They arrived in fifty mother ships, offering their friendship and advance technology to Earth. Skeptical of the visitors, Mike Donovan and Juliet Parrish infiltrated...</p>","body":"<p>1-2 They arrived in fifty mother ships, offering their friendship and advance technology to Earth. Skeptical of the visitors, Mike Donovan and Juliet Parrish infiltrated their ranks and soon discovered some startling secrets. The resistance is all that stands between us... and the visitors.</p><p>What walks down stairs, alone or in pairs, and makes a slinkity sound? A spring, a spring, a marvelous thing, everyone knows it&#39;s Slinky. It&#39;s Slinky, it&#39;s Slinky, for fun it&#39;s a wonderful toy. It&#39;s Slinky, it&#39;s Slinky, it&#39;s fun for a girl or a boy. It&#39;s fun for a girl or boy!</p><p>It seems today that all you see is violence in movies and sex on tv, but where are those good old-fashioned values on which we used to rely? Lucky there&#39;s a family guy, lucky there&#39;s a man who positively can do all the things that make us laugh and cry - he&#39;s our family guy!</p>"},{"title":"Scalar 2017 is officially announced!","permalink":"2016-01-05-scalar-2017-is-officially-announced","date":"2016-01-05","dateFormated":"January 05, 2016","excerpt":"<p>We are extremely happy to finally announce scalar 2017! It will be held on April 7th as always in Warsaw, Poland.  The world looks mighty good to me, cause Tootsie Rolls...</p>","body":"<p>We are extremely happy to finally announce scalar 2017! It will be held on April 7th as always in Warsaw, Poland.</p><p>The world looks mighty good to me, cause Tootsie Rolls are all I see. Whatever it is I think I see, becomes a Tootsie Roll to me! Tootsie Roll how I love your chocolatey chew, Tootsie Roll I think I&#39;m in love with you. Whatever it is I think I see, becomes a Tootsie Roll to me!</p><p>In an age when nature and magic rule the world, there is an extraordinary legend: the story of a warrior who communicates with animals, who fights sorcery and the unnatural. His name is Dar, last of his tribe. He is also called Beastmaster.</p>"}]